app/serializers/game_serializer.rb

SELECT "platforms".* FROM "platforms" INNER JOIN "games_platforms" ON "platforms"."id" = "games_platforms"."platform_id" WHERE "games_platforms"."game_id" = $1  [["game_id", 3]]
---
  def platforms
    object&.platforms.map{|p| p[:platform_name]}

SELECT "themes".* FROM "themes" INNER JOIN "games_themes" ON "themes"."id" = "games_themes"."theme_id" WHERE "games_themes"."game_id" = $1  [["game_id", 3]]
---
  def themes
    object&.themes.map{|t| t[:theme_name]}

SELECT "genres".* FROM "genres" INNER JOIN "games_genres" ON "genres"."id" = "games_genres"."genre_id" WHERE "games_genres"."game_id" = $1  [["game_id", 3]]
---
  def genres
    object&.genres.map{|g| g[:genre_name]}