app/controllers/api/v1/games_controller.rb

SELECT "games".* FROM "games"
---
      def index
        # renvois toutes les donnees de la db sous forme de json
        games = Game.all

INSERT INTO "games" ("game_name", "description", "release", "created_at", "updated_at", "editor_id", "devloper_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "platforms".* FROM "platforms" WHERE "platforms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "themes".* FROM "themes" WHERE "themes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def create
        platforms = params[:platforms]
        themes = params[:themes]
        genres = params[:genre]

        game = Game.new(game_params)

        platforms.each do |platform|
          game.platforms << Platform.find_by_id(platform)
        end

        themes.each do |theme|
          game.themes << Theme.find_by_id(theme)
        end

        genres.each do |genre|
          game.genres << Genre.find_by_id(genre)
        end

        if game.save

DELETE FROM "games" WHERE "games"."id" = $1  [["id", 81]]
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 81], ["LIMIT", 1]]
---
      def destroy
        Game.find(params[:id]).destroy!