app/controllers/api/v1/games_controller.rb

      def destroy
        Game.find(params[:id]).destroy!
---
DELETE FROM "games" WHERE "games"."id" = $1  [["id", 1]]